In [1]:
import pandas as pd
import numpy as np

# 1. unique()

In [56]:
df = pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [57]:
df['Survived'].unique()

array([0, 1, 2, 4], dtype=int64)

In [58]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [59]:
df['Embarked'].nunique()

3

In [60]:
df['Survived'].nunique()

4

# 2. value_counts()

In [61]:
df['Survived'].value_counts()

0    545
1    344
2      1
4      1
Name: Survived, dtype: int64

In [62]:
df = pd.read_csv('titanic.csv')
df
df['Survived'].value_counts()

0    545
1    344
2      1
4      1
Name: Survived, dtype: int64

In [63]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [64]:
d1 = df['Gender'].value_counts()

In [66]:
dict(d1)

{'male': 577, 'female': 314}

# 3. astype()

In [19]:
df['Survived'].astype('float')

0      0.0
1      1.0
2      1.0
3      1.0
4      0.0
      ...
886    0.0
887    1.0
888    0.0
889    1.0
890    0.0
Name: Survived, Length: 891, dtype: float64

In [20]:
df['Survived'].astype('str')

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: object

In [24]:
df = pd.DataFrame({"A":np.random.randint(10,20,size=5),
                  'B':[10,30,20,25,15]})
df

    A   B
0  14  10
1  19  30
2  15  20
3  17  25
4  13  15

In [26]:
df['C'] = 'Python'
df

    A   B       C
0  14  10  Python
1  19  30  Python
2  15  20  Python
3  17  25  Python
4  13  15  Python

In [37]:
df['C'] = df['A'] + df['B']
# df.info()
df

    A   B   C
0  14  10  24
1  19  30  49
2  15  20  35
3  17  25  42
4  13  15  28

In [38]:
df['D'] = df['A'] + 10
# df.info()
df

    A   B   C   D
0  14  10  24  24
1  19  30  49  29
2  15  20  35  25
3  17  25  42  27
4  13  15  28  23

In [40]:
df['E'] = df['B'] * 10
df

    A   B   C   D    E
0  14  10  24  24  100
1  19  30  49  29  300
2  15  20  35  25  200
3  17  25  42  27  250
4  13  15  28  23  150

In [42]:
df['F'] = 'Python'
df

    A   B   C   D    E       F
0  14  10  24  24  100  Python
1  19  30  49  29  300  Python
2  15  20  35  25  200  Python
3  17  25  42  27  250  Python
4  13  15  28  23  150  Python

In [45]:
df['G'] = df['F'] * 2
df

    A   B   C   D    E       F             G
0  14  10  24  24  100  Python  PythonPython
1  19  30  49  29  300  Python  PythonPython
2  15  20  35  25  200  Python  PythonPython
3  17  25  42  27  250  Python  PythonPython
4  13  15  28  23  150  Python  PythonPython

In [47]:
Principle_Amount = [100000,300000,800000,500000,700000]
Interest_Rate = [12,10.5,8.5,13,11]
Time = [3,4,4,5,7]
# compound_interest = A-P
# Amount = P(1+ R/100)^T
# CI = A-P

In [54]:
df = pd.DataFrame({'Principle_Amount': np.array(Principle_Amount),
                  'Interest_Rate': np.array(Interest_Rate),
                  'Time': np.array(Time)})

df['Amount'] = df['Principle_Amount'] * (1+ df['Interest_Rate']/100)**df['Time']
df['CI'] = df['Amount']- df['Principle_Amount'] 
df

   Principle_Amount  Interest_Rate  Time        Amount             CI
0            100000           12.0     3  1.404928e+05   40492.800000
1            300000           10.5     4  4.472706e+05  147270.615187
2            800000            8.5     4  1.108687e+06  308686.960500
3            500000           13.0     5  9.212176e+05  421217.589650
4            700000           11.0     7  1.453312e+06  753312.107029